# read csv file with pandas

In [1]:
import pandas as pd
import csv

# Basic read of csv file
filepath = './data/csv_s1.csv'
df = pd.read_csv(filepath)
print(df)

   Month   "1958"   "1959"   "1960"
0    JAN      340      360      417
1    FEB      318      342      391
2    MAR      362      406      419
3    APR      348      396      461
4    MAY      363      420      472
5    JUN      435      472      535
6    JUL      491      548      622
7    AUG      505      559      606
8    SEP      404      463      508
9    OCT      359      407      461
10   NOV      310      362      390
11   DEC      337      405      432

+ skip a row

In [2]:
df = pd.read_csv(filepath, skiprows=[0])
print(df)

    JAN    340    360    417
0   FEB    318    342    391
1   MAR    362    406    419
2   APR    348    396    461
3   MAY    363    420    472
4   JUN    435    472    535
5   JUL    491    548    622
6   AUG    505    559    606
7   SEP    404    463    508
8   OCT    359    407    461
9   NOV    310    362    390
10  DEC    337    405    432

+ Without header

In [3]:
df = pd.read_csv(filepath, skiprows=[0], header= None)
print(df)

      0    1    2    3
0   JAN  340  360  417
1   FEB  318  342  391
2   MAR  362  406  419
3   APR  348  396  461
4   MAY  363  420  472
5   JUN  435  472  535
6   JUL  491  548  622
7   AUG  505  559  606
8   SEP  404  463  508
9   OCT  359  407  461
10  NOV  310  362  390
11  DEC  337  405  432

+ Define header(added column names)

In [4]:
df = pd.read_csv(filepath, skiprows=[0], header= None, names=["Month",1958,1959,1960])
print(df)

   Month  1958  1959  1960
0    JAN   340   360   417
1    FEB   318   342   391
2    MAR   362   406   419
3    APR   348   396   461
4    MAY   363   420   472
5    JUN   435   472   535
6    JUL   491   548   622
7    AUG   505   559   606
8    SEP   404   463   508
9    OCT   359   407   461
10   NOV   310   362   390
11   DEC   337   405   432

+ Define index column
    - If a column has standard, it's more useful than just using column 0, 1, 2, ...

In [5]:
df = pd.read_csv(filepath, skiprows=[0], header= None, names=["Month",1958,1959,1960],
                 index_col = [0])
print(df)

       1958  1959  1960
Month
JAN     340   360   417
FEB     318   342   391
MAR     362   406   419
APR     348   396   461
MAY     363   420   472
JUN     435   472   535
JUL     491   548   622
AUG     505   559   606
SEP     404   463   508
OCT     359   407   461
NOV     310   362   390
DEC     337   405   432

+ Set a values as NaN

Below example, all "JAN" turn into NaN

In [6]:
df = pd.read_csv(filepath, skiprows=[0], header= None, names=["Month",1958,1959,1960],
                 na_values = ["JAN"])
print(df)
print()
print(pd.isnull(df))

   Month  1958  1959  1960
0    NaN   340   360   417
1    FEB   318   342   391
2    MAR   362   406   419
3    APR   348   396   461
4    MAY   363   420   472
5    JUN   435   472   535
6    JUL   491   548   622
7    AUG   505   559   606
8    SEP   404   463   508
9    OCT   359   407   461
10   NOV   310   362   390
11   DEC   337   405   432

    Month   1958   1959   1960
0    True  False  False  False
1   False  False  False  False
2   False  False  False  False
3   False  False  False  False
4   False  False  False  False
5   False  False  False  False
6   False  False  False  False
7   False  False  False  False
8   False  False  False  False
9   False  False  False  False
10  False  False  False  False
11  False  False  False  False

+ Organize the function

In [14]:
df = pd.read_csv(filepath, skiprows=[0], header= None, names=["Month",1958,1959,1960])
print(df); print()
print(df.index); print()
print(df.rename(index=lambda x : x+1)); print()
print(df.rename(index=lambda x : x+1).index); print()
print(df.index.values); print()
print(df.index.values.tolist())

   Month  1958  1959  1960
0    JAN   340   360   417
1    FEB   318   342   391
2    MAR   362   406   419
3    APR   348   396   461
4    MAY   363   420   472
5    JUN   435   472   535
6    JUL   491   548   622
7    AUG   505   559   606
8    SEP   404   463   508
9    OCT   359   407   461
10   NOV   310   362   390
11   DEC   337   405   432

RangeIndex(start=0, stop=12, step=1)

   Month  1958  1959  1960
1    JAN   340   360   417
2    FEB   318   342   391
3    MAR   362   406   419
4    APR   348   396   461
5    MAY   363   420   472
6    JUN   435   472   535
7    JUL   491   548   622
8    AUG   505   559   606
9    SEP   404   463   508
10   OCT   359   407   461
11   NOV   310   362   390
12   DEC   337   405   432

Int64Index([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12], dtype='int64')

[ 0  1  2  3  4  5  6  7  8  9 10 11]

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]

+ read new csv file

In [27]:
df2 = pd.read_csv('./data/csv_s2.csv',sep=';', skiprows=[0], header=None,
                  names=["First name", "Test1", "Test2", "Test3", "Final", "Grade"])
df2.head()

   First name  Test1  Test2  Test3  Final    Grade
0    Aloysius   40.0   90.0  100.0   83.0     "D-"
1  University   41.0   97.0   96.0   48.0     "D+"
2      Gramma   41.0   80.0   60.0   44.0      "C"
3    Electric   42.0   23.0   36.0   47.0     "B-"
4        Fred   43.0   78.0   88.0   45.0     "A-"

+ replace unnecessary characters

In [28]:
df2['Grade'] = df2['Grade'].str.replace('"', '')
df2.head()

   First name  Test1  Test2  Test3  Final  Grade
0    Aloysius   40.0   90.0  100.0   83.0     D-
1  University   41.0   97.0   96.0   48.0     D+
2      Gramma   41.0   80.0   60.0   44.0      C
3    Electric   42.0   23.0   36.0   47.0     B-
4        Fred   43.0   78.0   88.0   45.0     A-

+ added average of Tests and Final

In [29]:
df2['Avg'] = df2[['Test1','Test2','Test3','Final']].mean(axis=1)
df2.head()

   First name  Test1  Test2  Test3  Final  Grade    Avg
0    Aloysius   40.0   90.0  100.0   83.0     D-  78.25
1  University   41.0   97.0   96.0   48.0     D+  70.50
2      Gramma   41.0   80.0   60.0   44.0      C  56.25
3    Electric   42.0   23.0   36.0   47.0     B-  37.00
4        Fred   43.0   78.0   88.0   45.0     A-  63.50

+ added sum of Tests and final

In [31]:
df2['Sum'] = df2[['Test1','Test2','Test3','Final']].sum(axis=1)
df2.head()

   First name  Test1  Test2  Test3  Final  Grade    Avg    Sum
0    Aloysius   40.0   90.0  100.0   83.0     D-  78.25  313.0
1  University   41.0   97.0   96.0   48.0     D+  70.50  282.0
2      Gramma   41.0   80.0   60.0   44.0      C  56.25  225.0
3    Electric   42.0   23.0   36.0   47.0     B-  37.00  148.0
4        Fred   43.0   78.0   88.0   45.0     A-  63.50  254.0